Revit 2022 API
View Methods
The View type exposes the following members.
Methods
Name | Description
AddFilter
 Adds a filter to the view.
AllowsAnalysisDisplay
 Identifies if this view allows display of Analysis results.
ApplyViewTemplateParameters
 Applies to this view the parameters of the input view that are not controlled by the current view template.
AreGraphicsOverridesAllowed
 Determines if Visibility/Graphics Overriddes can be applied to the view.
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanApplyColorFillScheme
 Checks if the id can be applied as the scheme id of specified category to this view.
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanCategoryBeHidden
 Checks whether the category can be hidden in the view.
CanCategoryBeHiddenTemporary
 Check if category can be temporarily hidden in the view.
CanDeleteSubelement
 Checks if given subelement can be removed from the element.
 (Inherited from Element.)
CanEnableTemporaryViewPropertiesMode
 Indicates if Temporary View Properties mode can be applied for view in current state.
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
CanModifyDetailLevel
 Check if Detail Level can be modified.
CanModifyDisplayStyle
 Indicates if DisplayStyle can be modified.
CanModifyViewDiscipline
 Indicates if the View Discipline can be modified
CanUseDepthCueing
 Indicates if view can use Depth Cueing
CanUseTemporaryVisibilityModes
 Indicates if view can use temporary visibility modes
CanViewBeDuplicated
 Identifies if this view can be duplicated.
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
ConvertTemporaryHideIsolateToPermanent
 Convert all temporary hidden elements or categories to permanently hidden in view.
ConvertToIndependent
 Convert the dependent view to independent.
CreateViewTemplate
 Creates a new view template instance from this view instance.
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
DeleteSubelement
 Removes a subelement from the element.
 (Inherited from Element.)
DeleteSubelements
 Removes the subelements from the element.
 (Inherited from Element.)
DisableTemporaryViewMode
 Disables the specified temporary view mode.
Dispose |  (Inherited from Element.)
Duplicate
 Duplicates this view.
EnableRevealHiddenMode
 Enables Reveal Hidden elements mode.
EnableTemporaryViewPropertiesMode
 Turns Temporary View Properties mode on or off. In this mode, any changes made to the view are temporary and will be discarded once the mode is disabled.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetBackground
 Returns the current background set for the view.
GetCalloutParentId
 Gets ID of the callout parent view.
GetCategoryHidden
 Checks if elements of the given category are set to be invisible (hidden) in this view.
GetCategoryOverrides
 Gets graphic overrides for a category in view.
GetColorFillSchemeId
 Returns id of the color fill scheme element applied to the view.
GetCropRegionShapeManager
 Returns an object for managing view crop region shape.
GetCropRegionShapeManagerForReferenceCallout
 Returns an object for managing view crop region shape for reference callout.
GetDependentElements
 Get all elements that, from a logical point of view, are the children of this Element.
 (Inherited from Element.)
GetDependentViewIds
 Get the ids of dependent views.
GetDepthCueing
 Returns the current depth cueing settings for the view.
GetDirectContext3DHandleOverrides
 Returns DirectContext3D handle overrides object for the view.
GetElementOverrides
 Gets graphic overrides for an element in the view.
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetFilterOverrides
 Gets graphic overrides that a filter applies to the view.
GetFilters
 Gets the filters applied to the view.
GetFilterVisibility
 Gets the visibility of the elements associated with a filter.
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetIsFilterEnabled
 Identifies if the filter is enabled in this view.
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetNonControlledTemplateParameterIds
 Returns a list of parameters that are not marked as included when this view is used as a template.
GetOrderedFilters
 Gets the filters applied to the view in the order they are applied.
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameter
Retrieves a parameter from the element given identifier.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetPointCloudOverrides
 Returns point cloud overrides object for the view.
GetPrimaryViewId
 Get the id of the primary view.
GetReferenceCallouts
 Returns element ids of all reference callouts in the view.
GetReferenceElevations
 Returns element ids of all reference elevations in the view.
GetReferenceSections
 Returns element ids of all reference sections in the view.
GetSketchyLines
 Returns the current sketchy lines settings for the view.
GetSubelements
 Returns the collection of element subelements.
 (Inherited from Element.)
GetTemplateParameterIds
 Returns a list of parameter ids that may be controlled when this view is assigned as a template.
GetTemporaryViewPropertiesId
 When Temporary View Properties mode is in progress it provides view id that overrode settings for current view. Outside Temporary View Properties mode InvalidElementId will be returned.
GetTemporaryViewPropertiesName
 When Temporary View Properties mode is in progress, name of applied template is returned. Outside Temporary View Properties mode, empty string will be returned.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
GetViewDisplayModel
 Returns the current view display model settings for the view.
GetWorksetVisibility
 Returns the visibility settings of a workset for this particular view.
GetWorksharingDisplayMode
 Gets the current worksharing display mode for this view.
HasDetailLevel
 Check if the view has a Detail Level property
HasDisplayStyle
 Indicates if view has a DisplayStyle property
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
HasViewDiscipline
 Indicates if the view has a Discipline property
HideActiveWorkPlane
Hide the active work plane of the view.
HideCategoriesTemporary
 Set multiple categories to be temporarily hidden in the view.
HideCategoryTemporary
 Set one category to be temporarily hidden in the view.
HideElements
Sets the elements to be hidden in the view.
HideElementsTemporary
 Set multiple elements to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input.
HideElementTemporary
 Set one element to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
IsCategoryOverridable
 Checks whether the category can have graphic overrides in this view.
IsCreatedPhaseOrderValid
 Returns true if createdPhaseId and demolishedPhaseId are in order.
 (Inherited from Element.)
IsDemolishedPhaseOrderValid
 Returns true if createdPhaseId and demolishedPhaseId are in order.
 (Inherited from Element.)
IsElementVisibleInTemporaryViewMode
 Identifies if the input element is visible for the temporary view mode for this view.
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsFilterApplied
 Indicates if a filter is applied to the view.
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsInTemporaryViewMode
 Returns true if the view is in a particular temporary view mode.
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsolateCategoriesTemporary
 Set categories to be temporarily isolated in the view.
IsolateCategoryTemporary
 Set one category to be temporarily isolated in the view.
IsolateElementsTemporary
 Set multiple elements to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input.
IsolateElementTemporary
 Set one element to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsTemporaryHideIsolateActive
 Indicates if the view is temporarily hiding or isolating elements or categories.
IsTemporaryViewPropertiesModeEnabled
 Returns true when Temporary View Properties mode is in progress, false otherwise.
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
IsValidViewScale
 This validator checks that the view scale is in the allowable range.
IsValidViewTemplate
 Verifies that the view represented by templateId can be set as the controlling view template for this view.
IsViewValidForTemplateCreation
 Verifies that the view is valid for template creation.
IsWorksetVisible
 Indicates whether the workset is visible in this view.
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
Print()
Print this view with the default view template and using the print setting of the current active document.
Print(Boolean)
Print this view with the default view template, and either the view's document's print setting or the print setting of the current active document.
Print(View)
Print this view with the given view template and using the print setting of the current active document.
Print(View, Boolean)
Print this view with the given view template, and either the view's document's print setting or the print setting of the current active document.
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
RemoveCalloutParent
 Replaces callout parent ID with InvalidElementId.
RemoveFilter
 Removes a filter from the view.
RestoreCalloutParent
 Restores callout parent ID to the original view ID if that view is still available.
SetBackground
 Sets the background for the view. Background can only be set for 3d views and for Sections/Elevations.
SetCategoryHidden
 Sets if elements of the given category will be visible in this view.
SetCategoryOverrides
 Sets graphic overrides for a category in view.
SetColorFillSchemeId
 Applies color fill scheme to this view.
SetDepthCueing
 Sets the depth cueing settings for the view.
SetElementOverrides
 Sets graphic overrides for an element in the view.
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
SetFilterOverrides
 Sets the overrides associated with a filter.
SetFilterVisibility
 Sets the visibility of the elements associated with a filter.
SetIsFilterEnabled
 Sets the filter enabled flag.
SetNonControlledTemplateParameterIds
 Sets the parameters that will not be included when this view is used as a template.
SetSketchyLines
 Sets the sketchy lines settings for the view.
SetViewDisplayModel
 Sets the view display model settings for the view.
SetWorksetVisibility
 Sets visibility for a workset in this view.
SetWorksharingDisplayMode
 Sets the worksharing display mode for this view.
ShowActiveWorkPlane
Show the active work plane of the view.
SupportedColorFillCategoryIds
 Returns collection of all category ids that correspond to elements that can potentially be colored in this view according to a color fill scheme. The set may be different depending on the view type.
SupportsRevealConstraints
 Checks that the view can have the Reveal Constraints mode activated.
SupportsWorksharingDisplayMode
 Checks whether this view supports the given worksharing display mode.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UnhideElements
Sets the elements to be shown in the given view if they are currently hidden.
See Also
View Class
Autodesk.Revit.DB Namespace